{"meta":{"title":"废物避难所","subtitle":"","description":"","author":"曳涂","url":"http://example.com","root":"/"},"pages":[{"title":"标题","date":"2023-09-28T14:21:38.018Z","updated":"2023-09-28T14:21:38.018Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"死文青，极端派，理工男，情绪化，完毕"}],"posts":[{"title":"相对性自由粒子及其在标量场中的作用量","slug":"相对性自由粒子及其在标量场中的作用量","date":"2023-10-28T14:00:00.000Z","updated":"2023-11-04T10:03:21.112Z","comments":true,"path":"2023/10/28/相对性自由粒子及其在标量场中的作用量/","link":"","permalink":"http://example.com/2023/10/28/%E7%9B%B8%E5%AF%B9%E6%80%A7%E8%87%AA%E7%94%B1%E7%B2%92%E5%AD%90%E5%8F%8A%E5%85%B6%E5%9C%A8%E6%A0%87%E9%87%8F%E5%9C%BA%E4%B8%AD%E7%9A%84%E4%BD%9C%E7%94%A8%E9%87%8F/","excerpt":"","text":"前言 本文将会在相对论时空观下探讨分析力学的基本量——拉格朗日量的由来，在实际发展中，拉格朗日量最初只是凑出来为动能减势能，这是基于牛顿时空观的，在亚光速尺度这个定义就不适用了，于是我们就从相对时空观出发，导出拉格朗日量的形式。另外，本文均采用+---的度规，即。 正文 最小作用量原理 我们考虑一件事，一个小球从到且没有任何约束，显然有无数种走法，然而实际我们只会观察到一条路径，由于我们这里采用相对论时空观，这个轨迹就需要是洛伦兹不变的，我们可以将其采用世界线的形式，基于朴素的对称原理，我们可以认为，不同轨道之间一定有某种可以反映其特征的量，且这个量具有洛伦兹不变性，因为每个参考系所观察到的轨道都是一致的。物理学家把这个能反映轨道特征的量称作作用量，记作。由于的宗量并不是数，而是一个函数形式的轨道，因此从数学上来说，是世界线的泛函。我们记粒子的所有可能世界线为 这个被积函数就称作拉格朗日量，你可能会疑惑，为什么其不包含的更高阶导数，实际上，这是一条经验公式，我们并不清楚如何处理包含更高阶导数的理论。 它们有一些深刻的、系统性的困难。 这些困难被称为Ostrogradski不稳定性，即包含高阶导数的系统的能量没有下界，以至于系统中的所有态总会自发衰变到能量更低的态上去，这类系统中找不到稳定的状态。[1] 我们得到了作用量之后就会开始思考，真实轨迹对应的作用量有什么特点。答案是真实轨道的作用量需要取得极值。这个原理就是大名鼎鼎的最小作用量原理。我们对作用量进行变分，得到作用量取极值需要满足的条件为 详细推导见我的上一篇文章面向理论力学的变分法速通。 拉格朗日量本身并没有什么具体的物理意义，它只是我们为了区分不同的世界线所人为定义的一个量。它所确定的运动方程才是我们所关心的，拉格朗日量变了，但是由它所确定的经典运动方程没变，我们的经典物理就没变。 例如我们可以给拉格朗日量加上一个给定函数对于时间的全导数 积分后得到 变分后得 因为变分操作仅对进行，因此,又因为起点和终点的，所以后面两项的贡献为0。因此取极值时取极值，因此可以差一个给定函数对时间的全导数，但是若括号里就应写为而不一定为0，因此函数不能显含除外的变量。 时空坐标 在经典时空观中，不随伽利略变换而改变的是粒子的位矢，即，它不随伽利略变换而变化（注意，这里说的是它本身不变，并不是说它的分量不变，比如一个位矢是由Taki指向Anon，且假定这个位矢在坐标系1下为，伽利略变换至坐标系2后，该位矢的分量可能变为，但无论如何改变，它始终是由Taki指向Anon的。）。 但是回到相对性时空观，只用三个空间坐标分量是无法满足洛伦兹协变性的，因此我们需要引入时间分量，我们用 来表示,我们称其为一个逆变四矢量，角标在下我们就称其为协变四矢量，逆变和协变矢量可以通过度规来互相转化，如 这里我们已经采用了所谓的爱因斯坦求和约定（Einstein summation convention）,即对于两个相同指标默认求和。且已经求和的指标我们称其为赝指标，可以随意更换字母只要仍保持对其求和就行，比如上面的这个式子，我们可以将其写为 一个上标和一个相同下标的求和我们称其为指标的缩并。一个协变矢量与一个逆变矢量相乘并缩并掉上下标后，可以得到一个洛伦兹标量，也称为这两个矢量的内积。 自由粒子的运动方程 首先从对称性出发，我们可以断言自由粒子的作用量只会有如下形式 其中是该粒子世界线的线元，即。它是一个洛伦兹标量，前面的负号是为了兼容传统的牛顿力学，是物体的静质量，且必定为正值，这个稍候我们会给出证明，是真空中光速，这个的加入是为了让作用量的量纲与传统理论兼容。 三维形式拉格朗日量 我们首先用三维形式拉格朗日量对其求运动方程。 因此 这恰好是爱因斯坦给出的相对性粒子的动量，因此运动方程为 从这里我们也可以证明质量必须为正值，首先有 可见若则作用量的二阶泛函导数小于0，即此时作用量取得极大值，这是不符合最小作用量原理的。 四维协变 接下来我们直接对四维协变形式的作用量进行变分导出运动方程。首先，我们先找到一个粒子四维坐标的参数，这里我们取为粒子的固有时（即假设粒子自己带上一个时钟，该时钟上的读数即为粒子的固有时），记为，则有。 设，因为固有时是在粒子系中所得的所以此时有，又因为，故 分部积分得 其中边界项因为是固定起点终点的变分，故舍掉。由该式可知自由粒子运动方程即为,即匀速直线运动。 标量场中粒子 我们假定有一标量场它是一个无量纲的场,且，它对粒子的影响可以有各种方式，我们考虑最简单的情形，即使得线元长度发生变化，因为在时需退化到自由粒子情形，为了方便，我们选取指数函数刻画场对粒子影响。即 接下来我们采取四维协变变分的方法导出其运动方程，至于三维拉格朗日量形式，相信读者自证不难（其实是我懒得写了（笑））。 分部积分中，我们丢掉边界项得 即运动方程为 。[2] 基于对称性的现代物理学，超理汉化组译 ↩︎ 本文参考刘川老师的《理论力学》和高显老师的《经典力学》写就，如有斧正感激不尽。 ↩︎","categories":[],"tags":[{"name":"物理","slug":"物理","permalink":"http://example.com/tags/%E7%89%A9%E7%90%86/"},{"name":"分析力学","slug":"分析力学","permalink":"http://example.com/tags/%E5%88%86%E6%9E%90%E5%8A%9B%E5%AD%A6/"}]},{"title":"面向理论力学的变分法速通","slug":"面向理论力学的变分法速通","date":"2023-09-25T15:00:00.000Z","updated":"2023-10-28T14:47:16.282Z","comments":true,"path":"2023/09/25/面向理论力学的变分法速通/","link":"","permalink":"http://example.com/2023/09/25/%E9%9D%A2%E5%90%91%E7%90%86%E8%AE%BA%E5%8A%9B%E5%AD%A6%E7%9A%84%E5%8F%98%E5%88%86%E6%B3%95%E9%80%9F%E9%80%9A/","excerpt":"","text":"前言 笨人在自学理论力学的过程中感到数学基础不足，于是有了这篇文章。 前置知识只需多元函数微积分。ps:由于本人写作目的只是为了帮助学习 理论力学，因此本文所写知识的严谨性在数学上肯定欠佳，勿喷。 正文 来源 变分法的思想目前认为由雅各布伯努利在解决最速降线问题过程中提出。最速降线问题表述为：两端固定的光滑轨道，处于竖直向下的匀强重力场中，一个可视为质点的小球从顶端由静止开始滑落，问所需时间最小的轨道方程。 最速降线 不妨构建如图所示坐标系，记轨道方程为。小球在内走过的长度是,速度是，因此有 可以看出只与相关。但它并不是我们常规意义上的函数，函数是数集到数集上的映射，而此时，我们的操作对象成了一个函数，因此我们称其为泛函。形如 由于在理论力学中，系统的拉式量仅依赖于广义坐标与广义速度，因此，我们在本文中只会着重讨论 的情况。 欧拉-拉格朗日方程 回想我们研究函数极值的方法，是对做一个小变换，来观察函数值的变化。在泛函中我们也采取类似的方法，不过此时我们所变换的是函数（但只是将变换约束在方向），由此来观察泛函的变化。 两式相减则得 我们又知 注意我们符号的记法，我们约定所作用的是泛函，所作用的是变量，由于之前我们已经说过，变换是仅局限于方向的，因此。所以 易知取极值条件为。 前文已经提过，可视作在方向对进行变换，而微分是在方向变化，因此微分和变分可以交换顺序（这当然是不严谨的证明，但正如前言所说，我们只是为了学习理论力学，至于严谨性，就交给数学家吧（笑））。因此，我们有如下式子 因此积分符号中第二项可变为 我们注意到该式可类比分部积分法变为 代入原积分得 又因为起点和终点的,所以上式最后一项总贡献为0。 为了确保我们要求 这个式子就是变分法中最重要的公式，欧拉-拉格朗日方程。 特别的，对于不显含的情况即的情况,我们可以将方程再度化简，首先做变换，上式即变为 又因为 因为,所以 代入得 最速降线的解决 回到我们开头提到的最速降线问题，在这个问题中,其不显含,且由于为常数，为了方便计算不妨令其取值为1，代入上面方程有 化简得 可以验证该方程有参数方程解，,该曲线即方程解，我们又称其为摆线。 一些碎碎念 最速降线的问题其实是雅各布伯努利的弟弟约翰伯努利 提出来为了证明他比他哥哥强的，约翰的方法他自认为聪明无比，他将小球的运动轨迹类比为光在一块折射率随变化的大玻璃中的运动轨迹，利用折射定律直接列出微分方程求解，然而费马定理在当时并未得到证明，好笑的是，他哥哥在求解最速降线的过程中首先提出变分法思想，后来费马定理的证明恰恰利用了变分法，这算不算打脸呢（笑）。 我懒得重新画图了，因此最速降线的图是直接从高显老师理论力学讲义里直接截下来的，所以会糊，懒得改了（","categories":[],"tags":[{"name":"物理","slug":"物理","permalink":"http://example.com/tags/%E7%89%A9%E7%90%86/"},{"name":"分析力学","slug":"分析力学","permalink":"http://example.com/tags/%E5%88%86%E6%9E%90%E5%8A%9B%E5%AD%A6/"},{"name":"数学","slug":"数学","permalink":"http://example.com/tags/%E6%95%B0%E5%AD%A6/"}]}],"categories":[],"tags":[{"name":"物理","slug":"物理","permalink":"http://example.com/tags/%E7%89%A9%E7%90%86/"},{"name":"分析力学","slug":"分析力学","permalink":"http://example.com/tags/%E5%88%86%E6%9E%90%E5%8A%9B%E5%AD%A6/"},{"name":"数学","slug":"数学","permalink":"http://example.com/tags/%E6%95%B0%E5%AD%A6/"}]}